In [1]:
import pandas as pd

C:\Users\jamie\anaconda3\envs\PythonData\lib\site-packages\numpy\__init__.py:143: UserWarning: mkl-service package failed to import, therefore Intel(R) MKL initialization ensuring its correct out-of-the box operation under condition when Gnu OpenMP had already been loaded by Python process is not assured. Please install mkl-service package, see http://github.com/IntelPython/mkl-service
  from . import _distributor_init

ImportError: Unable to import required dependencies:
numpy:

IMPORTANT: PLEASE READ THIS FOR ADVICE ON HOW TO SOLVE THIS ISSUE!

Importing the numpy C-extensions failed. This error can happen for
many reasons, often due to issues with your setup or how NumPy was
installed.

We have compiled some common reasons and troubleshooting tips at:

    https://numpy.org/devdocs/user/troubleshooting-importerror.html

Please note and check the following:

  * The Python version is: Python3.7 from "C:\Users\jamie\anaconda3\envs\PythonData\python.exe"
  * The NumPy version is: "1.20.1"

and make sure that they are the versions you expect.
Please carefully study the documentation linked above for further help.

Original error was: DLL load failed: The specified module could not be found.

In [ ]:
file = "Resources/sampleData.csv"

In [ ]:
original_df = pd.read_csv(file)
original_df

     id first_name   last_name       Phone Number      Time zone
0     1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1     2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2     3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3     4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4     5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon
..  ...        ...         ...                ...            ...
95   96     Arthur   Henderson   81-(353)751-4060     Asia/Tokyo
96   97  Christina       Riley   93-(374)749-5085     Asia/Kabul
97   98   Nicholas       Green   86-(750)462-3375  Asia/Shanghai
98   99      Debra      Peters   86-(879)987-9025  Asia/Shanghai
99  100    Matthew      Murray  353-(195)215-1300  Europe/Dublin

[100 rows x 5 columns]

In [ ]:
original_df.columns

Index(['id', 'first_name', 'last_name', 'Phone Number', 'Time zone'], dtype='object')

In [ ]:
original_df.index

RangeIndex(start=0, stop=100, step=1)

In [ ]:
# set index to id
df = original_df.set_index("id")
df.head()

   first_name   last_name       Phone Number      Time zone
id
1       Peter  Richardson    7-(789)867-9023  Europe/Moscow
2      Janice       Berry   86-(614)973-1727    Asia/Harbin
3      Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
4      Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
5       Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [ ]:
# Set new index to last_name
df = original_df.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [ ]:
df.index

Index(['Richardson', 'Berry', 'Hudson', 'Mcdonald', 'Morales', 'Reyes', 'Kim',
       'Hudson', 'Day', 'Ford', 'Jones', 'Hamilton', 'Martin', 'Cook', 'Burke',
       'Kim', 'Collins', 'Day', 'Montgomery', 'Clark', 'Black', 'Robertson',
       'Andrews', 'Austin', 'Richardson', 'Rice', 'Walker', 'Meyer', 'Allen',
       'Holmes', 'Greene', 'Jordan', 'Perez', 'Morgan', 'Chavez', 'Jordan',
       'Bishop', 'Banks', 'Garrett', 'James', 'Perkins', 'Oliver', 'Reid',
       'Dunn', 'Vasquez', 'Johnson', 'Miller', 'Gonzalez', 'Washington',
       'Wells', 'Baker', 'Jackson', 'Shaw', 'Mendoza', 'Parker', 'Franklin',
       'Simmons', 'Bryant', 'Price', 'Harvey', 'Dixon', 'Sullivan', 'Scott',
       'Adams', 'Wagner', 'Williamson', 'Carroll', 'Roberts', 'Jackson',
       'Bryant', 'Tucker', 'Robinson', 'Torres', 'Butler', 'Lawrence',
       'Brooks', 'Snyder', 'Garza', 'Howell', 'Rogers', 'Butler', 'Franklin',
       'Garcia', 'Matthews', 'Shaw', 'Owens', 'Edwards', 'Matthews', 'Duncan',
       'Hudson', 'Brown', 'Jacobs', 'Chapman', 'Bell', 'Watkins', 'Henderson',
       'Riley', 'Green', 'Peters', 'Murray'],
      dtype='object', name='last_name')

In [ ]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)

Using Loc: 86-(614)973-1727
Using Iloc: 86-(614)973-1727

In [ ]:
# Grab the first five rows of data and the columns from "id" to "Phone Number"
# The problem with using "last_name" as the index is that the values are not unique so duplicates are returned
# If there are duplicates and loc[] is being used, Pandas will return an error
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson",
                                "Mcdonald", "Morales"], ["id", "first_name", "Phone Number"]]
richardson_to_morales

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

In [ ]:
# Using iloc[] Grab the first five rows of data and the columns from "id" to "Phone Number"
# will not find duplicates since a numeric index is always unique
# note with iloc the ending value is not inclusive (included)
also_richardson_to_morales = df.iloc[0:5, 0:3]
also_richardson_to_morales

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

In [ ]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number"]]

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124
...               ...                ...
Henderson      Arthur   81-(353)751-4060
Riley       Christina   93-(374)749-5085
Green        Nicholas   86-(750)462-3375
Peters          Debra   86-(879)987-9025
Murray        Matthew  353-(195)215-1300

[100 rows x 2 columns]

In [ ]:
# the following logic test/conditional statement returns a series of boolean values
named_billy = df["first_name"] == "Billy"
named_billy

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
              ...
Henderson     False
Riley         False
Green         False
Peters        False
Murray        False
Name: first_name, Length: 100, dtype: bool

In [ ]:
named_billy.value_counts()

False    97
True      3
Name: first_name, dtype: int64

In [ ]:
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = df.loc[(df["first_name"] == "Billy"), :]
only_billys

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

In [ ]:
# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (
    df["first_name"] == "Peter"), :]

only_billy_and_peter

Empty DataFrame
Columns: [id, first_name, Phone Number, Time zone]
Index: []